{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_source", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_source"}, "inbound_nodes": []}, {"name": "input_target", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_target"}, "inbound_nodes": []}, {"name": "model", "class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}], "input_layers": [["input_1", 0, 0]], "output_layers": [["input_1", 0, 0]]}, "inbound_nodes": [[["input_source", 0, 0, {}]], [["input_target", 0, 0, {}]]]}, {"name": "dense_layers", "class_name": "Sequential", "config": {"name": "dense_layers", "layers": [{"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null, "batch_input_shape": [null, 7, 7, 512]}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "embed", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}}]}, "inbound_nodes": [[["model", 1, 0, {}]], [["model", 2, 0, {}]]]}, {"name": "label_source", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "ragged": false, "name": "label_source"}, "inbound_nodes": []}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 0}, "inbound_nodes": [[["dense_layers", 1, 0, {}], ["dense_layers", 2, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": 0}, "inbound_nodes": [[["label_source", 0, 0, {}], ["label_source", 0, 0, {}]]]}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB0AGoBagJ8AIMBUwApAU4pA9oFa2VyYXPaB2JhY2tl\nbmTaDXN0b3BfZ3JhZGllbnQpAdoBeKkAcgUAAAD6VC9ob21lL2xoai9kb21haW4tYWRhcHRhdGlv\nbi9tb2RlbHMvdHdvX3N0cmVhbV9wYWlyX2VtYmVkc19hdHRlbnRpb25fbWlkX2NsYXNzd2lzZS5w\nedoIPGxhbWJkYT43AAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "models.two_stream_pair_embeds_attention_mid_classwise", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB0AGoBagJ8AIMBUwApAU4pA9oFa2VyYXPaB2JhY2tl\nbmTaDXN0b3BfZ3JhZGllbnQpAdoBeKkAcgUAAAD6VC9ob21lL2xoai9kb21haW4tYWRhcHRhdGlv\nbi9tb2RlbHMvdHdvX3N0cmVhbV9wYWlyX2VtYmVkc19hdHRlbnRpb25fbWlkX2NsYXNzd2lzZS5w\nedoIPGxhbWJkYT44AAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "models.two_stream_pair_embeds_attention_mid_classwise", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "label_target", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "ragged": false, "name": "label_target"}, "inbound_nodes": []}, {"name": "preds", "class_name": "Sequential", "config": {"name": "preds", "layers": [{"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null, "batch_input_shape": [null, 128]}}, {"class_name": "Dense", "config": {"name": "logits", "trainable": true, "dtype": "float32", "units": 31, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "preds", "trainable": true, "dtype": "float32", "activation": "softmax"}}]}, "inbound_nodes": [[["dense_layers", 1, 0, {}]], [["dense_layers", 2, 0, {}]]]}, {"name": "dense_attention", "class_name": "DenseAttention", "config": {"name": "dense_attention", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "classes": 31, "activation": "softmax", "omit_intra_domain": true, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {"labels": ["lambda_1", 0, 0]}]]]}, {"name": "dense_attention_1", "class_name": "DenseAttention", "config": {"name": "dense_attention_1", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "classes": 31, "activation": "softmax", "omit_intra_domain": true, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {"labels": ["lambda_1", 0, 0]}]]]}, {"name": "tf_op_layer_Sum", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum", "trainable": true, "dtype": null, "node_def": {"name": "Sum", "op": "Sum", "input": ["dense_attention/Identity", "Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": 1}}, "inbound_nodes": [[["dense_attention", 0, 0, {}]]]}, {"name": "tf_op_layer_Sum_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum_1", "trainable": true, "dtype": null, "node_def": {"name": "Sum_1", "op": "Sum", "input": ["dense_attention_1/Identity", "Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": 1}}, "inbound_nodes": [[["dense_attention_1", 0, 0, {}]]]}, {"name": "tf_op_layer_concat", "class_name": "TensorFlowOpLayer", "config": {"name": "concat", "trainable": true, "dtype": null, "node_def": {"name": "concat", "op": "ConcatV2", "input": ["dense_layers/Identity", "dense_layers_1/Identity", "concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": 0}}, "inbound_nodes": [[["dense_layers", 1, 0, {}], ["dense_layers", 2, 0, {}]]]}, {"name": "tf_op_layer_diag", "class_name": "TensorFlowOpLayer", "config": {"name": "diag", "trainable": true, "dtype": null, "node_def": {"name": "diag", "op": "MatrixDiag", "input": ["Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sum", 0, 0, {}]]]}, {"name": "tf_op_layer_diag_1", "class_name": "TensorFlowOpLayer", "config": {"name": "diag_1", "trainable": true, "dtype": null, "node_def": {"name": "diag_1", "op": "MatrixDiag", "input": ["Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sum_1", 0, 0, {}]]]}, {"name": "tf_op_layer_transpose", "class_name": "TensorFlowOpLayer", "config": {"name": "transpose", "trainable": true, "dtype": null, "node_def": {"name": "transpose", "op": "Transpose", "input": ["concat", "transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 0]}}, "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]}, {"name": "tf_op_layer_Sub", "class_name": "TensorFlowOpLayer", "config": {"name": "Sub", "trainable": true, "dtype": null, "node_def": {"name": "Sub", "op": "Sub", "input": ["diag", "dense_attention/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_diag", 0, 0, {}], ["dense_attention", 0, 0, {}]]]}, {"name": "tf_op_layer_Sub_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Sub_1", "trainable": true, "dtype": null, "node_def": {"name": "Sub_1", "op": "Sub", "input": ["diag_1", "dense_attention_1/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_diag_1", 0, 0, {}], ["dense_attention_1", 0, 0, {}]]]}, {"name": "tf_op_layer_MatMul", "class_name": "TensorFlowOpLayer", "config": {"name": "MatMul", "trainable": true, "dtype": null, "node_def": {"name": "MatMul", "op": "MatMul", "input": ["Sub", "transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": true}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sub", 0, 0, {}], ["tf_op_layer_transpose", 0, 0, {}]]]}, {"name": "tf_op_layer_MatMul_2", "class_name": "TensorFlowOpLayer", "config": {"name": "MatMul_2", "trainable": true, "dtype": null, "node_def": {"name": "MatMul_2", "op": "MatMul", "input": ["Sub_1", "transpose"], "attr": {"transpose_b": {"b": true}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sub_1", 0, 0, {}], ["tf_op_layer_transpose", 0, 0, {}]]]}, {"name": "tf_op_layer_MatMul_1", "class_name": "TensorFlowOpLayer", "config": {"name": "MatMul_1", "trainable": true, "dtype": null, "node_def": {"name": "MatMul_1", "op": "MatMul", "input": ["transpose", "MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_transpose", 0, 0, {}], ["tf_op_layer_MatMul", 0, 0, {}]]]}, {"name": "tf_op_layer_MatMul_3", "class_name": "TensorFlowOpLayer", "config": {"name": "MatMul_3", "trainable": true, "dtype": null, "node_def": {"name": "MatMul_3", "op": "MatMul", "input": ["transpose", "MatMul_2"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_transpose", 0, 0, {}], ["tf_op_layer_MatMul_2", 0, 0, {}]]]}, {"name": "tf_op_layer_Trace/diag_part", "class_name": "TensorFlowOpLayer", "config": {"name": "Trace/diag_part", "trainable": true, "dtype": null, "node_def": {"name": "Trace/diag_part", "op": "MatrixDiagPart", "input": ["MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_MatMul_1", 0, 0, {}]]]}, {"name": "tf_op_layer_Trace_1/diag_part", "class_name": "TensorFlowOpLayer", "config": {"name": "Trace_1/diag_part", "trainable": true, "dtype": null, "node_def": {"name": "Trace_1/diag_part", "op": "MatrixDiagPart", "input": ["MatMul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_MatMul_3", 0, 0, {}]]]}, {"name": "tf_op_layer_Trace", "class_name": "TensorFlowOpLayer", "config": {"name": "Trace", "trainable": true, "dtype": null, "node_def": {"name": "Trace", "op": "Sum", "input": ["Trace/diag_part", "Trace/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1]}}, "inbound_nodes": [[["tf_op_layer_Trace/diag_part", 0, 0, {}]]]}, {"name": "tf_op_layer_Trace_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Trace_1", "trainable": true, "dtype": null, "node_def": {"name": "Trace_1", "op": "Sum", "input": ["Trace_1/diag_part", "Trace_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1]}}, "inbound_nodes": [[["tf_op_layer_Trace_1/diag_part", 0, 0, {}]]]}, {"name": "tf_op_layer_truediv", "class_name": "TensorFlowOpLayer", "config": {"name": "truediv", "trainable": true, "dtype": null, "node_def": {"name": "truediv", "op": "RealDiv", "input": ["Trace", "Trace_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Trace", 0, 0, {}], ["tf_op_layer_Trace_1", 0, 0, {}]]]}, {"name": "tf_op_layer_Mul_2", "class_name": "TensorFlowOpLayer", "config": {"name": "Mul_2", "trainable": true, "dtype": null, "node_def": {"name": "Mul_2", "op": "Mul", "input": ["Mul_2/x", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.25}}, "inbound_nodes": [[["tf_op_layer_truediv", 0, 0, {}]]]}, {"name": "add_loss", "class_name": "AddLoss", "config": {"name": "add_loss", "trainable": true, "dtype": "float32", "unconditional": false}, "inbound_nodes": [[["tf_op_layer_Mul_2", 0, 0, {}]]]}, {"name": "tf_op_layer_Sum_2", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum_2", "trainable": true, "dtype": null, "node_def": {"name": "Sum_2", "op": "Sum", "input": ["preds_1/Identity", "Sum_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": -1}}, "inbound_nodes": [[["preds", 1, 0, {}]]]}, {"name": "tf_op_layer_truediv_1", "class_name": "TensorFlowOpLayer", "config": {"name": "truediv_1", "trainable": true, "dtype": null, "node_def": {"name": "truediv_1", "op": "RealDiv", "input": ["preds_1/Identity", "Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["preds", 1, 0, {}], ["tf_op_layer_Sum_2", 0, 0, {}]]]}, {"name": "tf_op_layer_clip_by_value/Minimum", "class_name": "TensorFlowOpLayer", "config": {"name": "clip_by_value/Minimum", "trainable": true, "dtype": null, "node_def": {"name": "clip_by_value/Minimum", "op": "Minimum", "input": ["truediv_1", "clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.9999998807907104}}, "inbound_nodes": [[["tf_op_layer_truediv_1", 0, 0, {}]]]}, {"name": "tf_op_layer_clip_by_value", "class_name": "TensorFlowOpLayer", "config": {"name": "clip_by_value", "trainable": true, "dtype": null, "node_def": {"name": "clip_by_value", "op": "Maximum", "input": ["clip_by_value/Minimum", "clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0000000116860974e-07}}, "inbound_nodes": [[["tf_op_layer_clip_by_value/Minimum", 0, 0, {}]]]}, {"name": "tf_op_layer_Log", "class_name": "TensorFlowOpLayer", "config": {"name": "Log", "trainable": true, "dtype": null, "node_def": {"name": "Log", "op": "Log", "input": ["clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_clip_by_value", 0, 0, {}]]]}, {"name": "tf_op_layer_mul", "class_name": "TensorFlowOpLayer", "config": {"name": "mul", "trainable": true, "dtype": null, "node_def": {"name": "mul", "op": "Mul", "input": ["label_source", "Log"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["label_source", 0, 0, {}], ["tf_op_layer_Log", 0, 0, {}]]]}, {"name": "tf_op_layer_Sum_3", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum_3", "trainable": true, "dtype": null, "node_def": {"name": "Sum_3", "op": "Sum", "input": ["mul", "Sum_3/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": -1}}, "inbound_nodes": [[["tf_op_layer_mul", 0, 0, {}]]]}, {"name": "tf_op_layer_Neg", "class_name": "TensorFlowOpLayer", "config": {"name": "Neg", "trainable": true, "dtype": null, "node_def": {"name": "Neg", "op": "Neg", "input": ["Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sum_3", 0, 0, {}]]]}, {"name": "tf_op_layer_Mean", "class_name": "TensorFlowOpLayer", "config": {"name": "Mean", "trainable": true, "dtype": null, "node_def": {"name": "Mean", "op": "Mean", "input": ["Neg", "Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": [0]}}, "inbound_nodes": [[["tf_op_layer_Neg", 0, 0, {}]]]}, {"name": "tf_op_layer_Mul_3", "class_name": "TensorFlowOpLayer", "config": {"name": "Mul_3", "trainable": true, "dtype": null, "node_def": {"name": "Mul_3", "op": "Mul", "input": ["Mul_3/x", "Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.375}}, "inbound_nodes": [[["tf_op_layer_Mean", 0, 0, {}]]]}, {"name": "add_loss_1", "class_name": "AddLoss", "config": {"name": "add_loss_1", "trainable": true, "dtype": "float32", "unconditional": false}, "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}]]]}, {"name": "tf_op_layer_Sum_4", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum_4", "trainable": true, "dtype": null, "node_def": {"name": "Sum_4", "op": "Sum", "input": ["preds_2/Identity", "Sum_4/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": -1}}, "inbound_nodes": [[["preds", 2, 0, {}]]]}, {"name": "tf_op_layer_truediv_2", "class_name": "TensorFlowOpLayer", "config": {"name": "truediv_2", "trainable": true, "dtype": null, "node_def": {"name": "truediv_2", "op": "RealDiv", "input": ["preds_2/Identity", "Sum_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["preds", 2, 0, {}], ["tf_op_layer_Sum_4", 0, 0, {}]]]}, {"name": "tf_op_layer_clip_by_value_1/Minimum", "class_name": "TensorFlowOpLayer", "config": {"name": "clip_by_value_1/Minimum", "trainable": true, "dtype": null, "node_def": {"name": "clip_by_value_1/Minimum", "op": "Minimum", "input": ["truediv_2", "clip_by_value_1/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.9999998807907104}}, "inbound_nodes": [[["tf_op_layer_truediv_2", 0, 0, {}]]]}, {"name": "tf_op_layer_clip_by_value_1", "class_name": "TensorFlowOpLayer", "config": {"name": "clip_by_value_1", "trainable": true, "dtype": null, "node_def": {"name": "clip_by_value_1", "op": "Maximum", "input": ["clip_by_value_1/Minimum", "clip_by_value_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0000000116860974e-07}}, "inbound_nodes": [[["tf_op_layer_clip_by_value_1/Minimum", 0, 0, {}]]]}, {"name": "tf_op_layer_Log_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Log_1", "trainable": true, "dtype": null, "node_def": {"name": "Log_1", "op": "Log", "input": ["clip_by_value_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_clip_by_value_1", 0, 0, {}]]]}, {"name": "tf_op_layer_mul_1", "class_name": "TensorFlowOpLayer", "config": {"name": "mul_1", "trainable": true, "dtype": null, "node_def": {"name": "mul_1", "op": "Mul", "input": ["label_target", "Log_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["label_target", 0, 0, {}], ["tf_op_layer_Log_1", 0, 0, {}]]]}, {"name": "tf_op_layer_Sum_5", "class_name": "TensorFlowOpLayer", "config": {"name": "Sum_5", "trainable": true, "dtype": null, "node_def": {"name": "Sum_5", "op": "Sum", "input": ["mul_1", "Sum_5/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": -1}}, "inbound_nodes": [[["tf_op_layer_mul_1", 0, 0, {}]]]}, {"name": "tf_op_layer_Neg_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Neg_1", "trainable": true, "dtype": null, "node_def": {"name": "Neg_1", "op": "Neg", "input": ["Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Sum_5", 0, 0, {}]]]}, {"name": "tf_op_layer_Mean_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Mean_1", "trainable": true, "dtype": null, "node_def": {"name": "Mean_1", "op": "Mean", "input": ["Neg_1", "Mean_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "inbound_nodes": [[["tf_op_layer_Neg_1", 0, 0, {}]]]}, {"name": "tf_op_layer_Mul_4", "class_name": "TensorFlowOpLayer", "config": {"name": "Mul_4", "trainable": true, "dtype": null, "node_def": {"name": "Mul_4", "op": "Mul", "input": ["Mul_4/x", "Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.375}}, "inbound_nodes": [[["tf_op_layer_Mean_1", 0, 0, {}]]]}, {"name": "add_loss_2", "class_name": "AddLoss", "config": {"name": "add_loss_2", "trainable": true, "dtype": "float32", "unconditional": false}, "inbound_nodes": [[["tf_op_layer_Mul_4", 0, 0, {}]]]}, {"name": "add_metric", "class_name": "AddMetric", "config": {"name": "add_metric", "trainable": true, "dtype": "float32", "aggregation": "mean", "metric_name": "ce_loss_src"}, "inbound_nodes": [[["tf_op_layer_Mean", 0, 0, {}]]]}, {"name": "add_metric_1", "class_name": "AddMetric", "config": {"name": "add_metric_1", "trainable": true, "dtype": "float32", "aggregation": "mean", "metric_name": "ce_loss_tgt"}, "inbound_nodes": [[["tf_op_layer_Mean_1", 0, 0, {}]]]}, {"name": "add_metric_2", "class_name": "AddMetric", "config": {"name": "add_metric_2", "trainable": true, "dtype": "float32", "aggregation": "mean", "metric_name": "aux_loss"}, "inbound_nodes": [[["tf_op_layer_truediv", 0, 0, {}]]]}, {"name": "tf_op_layer_ArgMax_2", "class_name": "TensorFlowOpLayer", "config": {"name": "ArgMax_2", "trainable": true, "dtype": null, "node_def": {"name": "ArgMax_2", "op": "ArgMax", "input": ["label_source", "ArgMax_2/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": -1}}, "inbound_nodes": [[["label_source", 0, 0, {}]]]}, {"name": "tf_op_layer_ArgMax_3", "class_name": "TensorFlowOpLayer", "config": {"name": "ArgMax_3", "trainable": true, "dtype": null, "node_def": {"name": "ArgMax_3", "op": "ArgMax", "input": ["preds_1/Identity", "ArgMax_3/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": -1}}, "inbound_nodes": [[["preds", 1, 0, {}]]]}, {"name": "tf_op_layer_Equal", "class_name": "TensorFlowOpLayer", "config": {"name": "Equal", "trainable": true, "dtype": null, "node_def": {"name": "Equal", "op": "Equal", "input": ["ArgMax_2", "ArgMax_3"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_ArgMax_2", 0, 0, {}], ["tf_op_layer_ArgMax_3", 0, 0, {}]]]}, {"name": "tf_op_layer_Cast_2", "class_name": "TensorFlowOpLayer", "config": {"name": "Cast_2", "trainable": true, "dtype": null, "node_def": {"name": "Cast_2", "op": "Cast", "input": ["Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Equal", 0, 0, {}]]]}, {"name": "add_metric_3", "class_name": "AddMetric", "config": {"name": "add_metric_3", "trainable": true, "dtype": "float32", "aggregation": "mean", "metric_name": "preds_acc_src"}, "inbound_nodes": [[["tf_op_layer_Cast_2", 0, 0, {}]]]}, {"name": "tf_op_layer_ArgMax_4", "class_name": "TensorFlowOpLayer", "config": {"name": "ArgMax_4", "trainable": true, "dtype": null, "node_def": {"name": "ArgMax_4", "op": "ArgMax", "input": ["label_target", "ArgMax_4/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}, "constants": {"1": -1}}, "inbound_nodes": [[["label_target", 0, 0, {}]]]}, {"name": "tf_op_layer_ArgMax_5", "class_name": "TensorFlowOpLayer", "config": {"name": "ArgMax_5", "trainable": true, "dtype": null, "node_def": {"name": "ArgMax_5", "op": "ArgMax", "input": ["preds_2/Identity", "ArgMax_5/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": -1}}, "inbound_nodes": [[["preds", 2, 0, {}]]]}, {"name": "tf_op_layer_Equal_1", "class_name": "TensorFlowOpLayer", "config": {"name": "Equal_1", "trainable": true, "dtype": null, "node_def": {"name": "Equal_1", "op": "Equal", "input": ["ArgMax_4", "ArgMax_5"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_ArgMax_4", 0, 0, {}], ["tf_op_layer_ArgMax_5", 0, 0, {}]]]}, {"name": "tf_op_layer_Cast_3", "class_name": "TensorFlowOpLayer", "config": {"name": "Cast_3", "trainable": true, "dtype": null, "node_def": {"name": "Cast_3", "op": "Cast", "input": ["Equal_1"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, "constants": {}}, "inbound_nodes": [[["tf_op_layer_Equal_1", 0, 0, {}]]]}, {"name": "add_metric_4", "class_name": "AddMetric", "config": {"name": "add_metric_4", "trainable": true, "dtype": "float32", "aggregation": "mean", "metric_name": "preds_acc"}, "inbound_nodes": [[["tf_op_layer_Cast_3", 0, 0, {}]]]}], "input_layers": [["input_source", 0, 0], ["input_target", 0, 0], ["label_source", 0, 0], ["label_target", 0, 0]], "output_layers": [["dense_layers", 1, 0], ["dense_layers", 2, 0], ["preds", 1, 0], ["preds", 2, 0], ["dense_attention", 0, 0], ["dense_attention_1", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}