{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Model", "config": {"name": "resnet50v2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv1_conv", "class_name": "Conv2D", "config": {"name": "conv1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "pool1_pad", "class_name": "ZeroPadding2D", "config": {"name": "pool1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_conv", 0, 0, {}]]]}, {"name": "pool1_pool", "class_name": "MaxPooling2D", "config": {"name": "pool1_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["pool1_pad", 0, 0, {}]]]}, {"name": "conv2_block1_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pool1_pool", 0, 0, {}]]]}, {"name": "conv2_block1_preact_relu", "class_name": "Activation", "config": {"name": "conv2_block1_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_preact_bn", 0, 0, {}]]]}, {"name": "conv2_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv2_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"name": "conv2_block1_1_relu", "class_name": "Activation", "config": {"name": "conv2_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"name": "conv2_block1_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"name": "conv2_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_2_pad", 0, 0, {}]]]}, {"name": "conv2_block1_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]]}, {"name": "conv2_block1_2_relu", "class_name": "Activation", "config": {"name": "conv2_block1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]]}, {"name": "conv2_block1_0_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv2_block1_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]]}, {"name": "conv2_block1_out", "class_name": "Add", "config": {"name": "conv2_block1_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}], ["conv2_block1_3_conv", 0, 0, {}]]]}, {"name": "conv2_block2_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]]}, {"name": "conv2_block2_preact_relu", "class_name": "Activation", "config": {"name": "conv2_block2_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_preact_bn", 0, 0, {}]]]}, {"name": "conv2_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_preact_relu", 0, 0, {}]]]}, {"name": "conv2_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"name": "conv2_block2_1_relu", "class_name": "Activation", "config": {"name": "conv2_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"name": "conv2_block2_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2_block2_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"name": "conv2_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_2_pad", 0, 0, {}]]]}, {"name": "conv2_block2_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]]}, {"name": "conv2_block2_2_relu", "class_name": "Activation", "config": {"name": "conv2_block2_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]]}, {"name": "conv2_block2_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]]}, {"name": "conv2_block2_out", "class_name": "Add", "config": {"name": "conv2_block2_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_conv", 0, 0, {}]]]}, {"name": "conv2_block3_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]]}, {"name": "conv2_block3_preact_relu", "class_name": "Activation", "config": {"name": "conv2_block3_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_preact_bn", 0, 0, {}]]]}, {"name": "conv2_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_preact_relu", 0, 0, {}]]]}, {"name": "conv2_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"name": "conv2_block3_1_relu", "class_name": "Activation", "config": {"name": "conv2_block3_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"name": "conv2_block3_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2_block3_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"name": "conv2_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_2_pad", 0, 0, {}]]]}, {"name": "conv2_block3_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]]}, {"name": "conv2_block3_2_relu", "class_name": "Activation", "config": {"name": "conv2_block3_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]]}, {"name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]]}, {"name": "conv2_block3_3_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_3_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]]}, {"name": "conv2_block3_out", "class_name": "Add", "config": {"name": "conv2_block3_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}], ["conv2_block3_3_conv", 0, 0, {}]]]}, {"name": "conv3_block1_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]]}, {"name": "conv3_block1_preact_relu", "class_name": "Activation", "config": {"name": "conv3_block1_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_preact_bn", 0, 0, {}]]]}, {"name": "conv3_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv3_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"name": "conv3_block1_1_relu", "class_name": "Activation", "config": {"name": "conv3_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"name": "conv3_block1_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]]}, {"name": "conv3_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_2_pad", 0, 0, {}]]]}, {"name": "conv3_block1_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]]}, {"name": "conv3_block1_2_relu", "class_name": "Activation", "config": {"name": "conv3_block1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]]}, {"name": "conv3_block1_0_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv3_block1_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block1_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]]}, {"name": "conv3_block1_out", "class_name": "Add", "config": {"name": "conv3_block1_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}], ["conv3_block1_3_conv", 0, 0, {}]]]}, {"name": "conv3_block2_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]]}, {"name": "conv3_block2_preact_relu", "class_name": "Activation", "config": {"name": "conv3_block2_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_preact_bn", 0, 0, {}]]]}, {"name": "conv3_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_preact_relu", 0, 0, {}]]]}, {"name": "conv3_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"name": "conv3_block2_1_relu", "class_name": "Activation", "config": {"name": "conv3_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"name": "conv3_block2_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3_block2_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]]}, {"name": "conv3_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_2_pad", 0, 0, {}]]]}, {"name": "conv3_block2_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block2_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]]}, {"name": "conv3_block2_2_relu", "class_name": "Activation", "config": {"name": "conv3_block2_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]]}, {"name": "conv3_block2_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block2_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]]}, {"name": "conv3_block2_out", "class_name": "Add", "config": {"name": "conv3_block2_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_conv", 0, 0, {}]]]}, {"name": "conv3_block3_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]]}, {"name": "conv3_block3_preact_relu", "class_name": "Activation", "config": {"name": "conv3_block3_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_preact_bn", 0, 0, {}]]]}, {"name": "conv3_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_preact_relu", 0, 0, {}]]]}, {"name": "conv3_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"name": "conv3_block3_1_relu", "class_name": "Activation", "config": {"name": "conv3_block3_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"name": "conv3_block3_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3_block3_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]]}, {"name": "conv3_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_2_pad", 0, 0, {}]]]}, {"name": "conv3_block3_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block3_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]]}, {"name": "conv3_block3_2_relu", "class_name": "Activation", "config": {"name": "conv3_block3_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]]}, {"name": "conv3_block3_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block3_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]]}, {"name": "conv3_block3_out", "class_name": "Add", "config": {"name": "conv3_block3_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_conv", 0, 0, {}]]]}, {"name": "conv3_block4_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]]}, {"name": "conv3_block4_preact_relu", "class_name": "Activation", "config": {"name": "conv3_block4_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_preact_bn", 0, 0, {}]]]}, {"name": "conv3_block4_1_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_preact_relu", 0, 0, {}]]]}, {"name": "conv3_block4_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"name": "conv3_block4_1_relu", "class_name": "Activation", "config": {"name": "conv3_block4_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"name": "conv3_block4_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3_block4_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]]}, {"name": "conv3_block4_2_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_2_pad", 0, 0, {}]]]}, {"name": "conv3_block4_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_block4_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]]}, {"name": "conv3_block4_2_relu", "class_name": "Activation", "config": {"name": "conv3_block4_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]]}, {"name": "conv3_block4_3_conv", "class_name": "Conv2D", "config": {"name": "conv3_block4_3_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]]}, {"name": "conv3_block4_out", "class_name": "Add", "config": {"name": "conv3_block4_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv3_block4_3_conv", 0, 0, {}]]]}, {"name": "conv4_block1_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_block1_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]]}, {"name": "conv4_block1_preact_relu", "class_name": "Activation", "config": {"name": "conv4_block1_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_block1_preact_bn", 0, 0, {}]]]}, {"name": "conv4_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv4_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv4_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_block1_1_conv", 0, 0, {}]]]}, {"name": "conv4_block1_1_relu", "class_name": "Activation", "config": {"name": "conv4_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_block1_1_bn", 0, 0, {}]]]}, {"name": "conv4_block1_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv4_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv4_block1_1_relu", 0, 0, {}]]]}, {"name": "conv4_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv4_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_block1_2_pad", 0, 0, {}]]]}, {"name": "conv4_block1_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_block1_2_conv", 0, 0, {}]]]}, {"name": "conv4_block1_2_relu", "class_name": "Activation", "config": {"name": "conv4_block1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_block1_2_bn", 0, 0, {}]]]}, {"name": "conv4_block1_0_conv", "class_name": "Conv2D", "config": {"name": "conv4_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_block1_preact_relu", 0, 0, {}]]]}, {"name": "conv4_block1_3_conv", "class_name": "Conv2D", "config": {"name": "conv4_block1_3_conv", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_block1_2_relu", 0, 0, {}]]]}, {"name": "conv4_block1_out", "class_name": "Add", "config": {"name": "conv4_block1_out", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv4_block1_0_conv", 0, 0, {}], ["conv4_block1_3_conv", 0, 0, {}]]]}, {"name": "conv4_block2_preact_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_block2_preact_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_block1_out", 0, 0, {}]]]}, {"name": "conv4_block2_preact_relu", "class_name": "Activation", "config": {"name": "conv4_block2_preact_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_block2_preact_bn", 0, 0, {}]]]}, {"name": "conv4_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv4_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_block2_preact_relu", 0, 0, {}]]]}, {"name": "conv4_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_block2_1_conv", 0, 0, {}]]]}, {"name": "conv4_block2_1_relu", "class_name": "Activation", "config": {"name": "conv4_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_block2_1_bn", 0, 0, {}]]]}, {"name": "conv4_block2_2_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv4_block2_2_pad", 